#+TITLE: Build
* Build "pipeline"
hacked hook on rob's fork of test-infra published as a container image to
ghcr.io [[https://github.com/users/RobertKielty/packages/container/package/test-infra%2Fhook-1eb1aded4295c31cc560eb5b2f39bd36][Packages]] is linked on that repo

Rob's fork of hook has the k8s build cluster setup stripped out of. This is
temporary hack to protoype launching a Prow Plugin from a Github Action.

#+begin_src tmate :session hpda-cntr-build
export CR_PATH=$(cat ~/.github/.PAT)
echo $CR_PAT | docker login ghcr.io -u RobertKielty --password-stdin
#docker build -t hpda:latest .
ko build .
#+end_src

#+RESULTS:
#+begin_example
#+end_example

There's no point in running this as a local container as
the next step here is to get this *launched* from a github action.

However, I am currently troubleshooting the following output when
we [[https://github.com/mock-cncf-project-org/mock-project/runs/7618521661?check_suite_focus=true][using this GH Action ..]]

#+begin_quote
Run RobertKielty/hook-plugin-docker-action@main
  with:
    plugin: size
/usr/bin/docker run --name cd98f5c69b6441ff748baba0e4ccf2b30094c_756e75 --label 4cd98f --workdir /github/workspace --rm -e INPUT_HMAC -e INPUT_GH-APP-ID-PIVATE-KEY -e INPUT_PLUGIN -e HOME -e GITHUB_JOB -e GITHUB_REF -e GITHUB_SHA -e GITHUB_REPOSITORY -e GITHUB_REPOSITORY_OWNER -e GITHUB_RUN_ID -e GITHUB_RUN_NUMBER -e GITHUB_RETENTION_DAYS -e GITHUB_RUN_ATTEMPT -e GITHUB_ACTOR -e GITHUB_TRIGGERING_ACTOR -e GITHUB_WORKFLOW -e GITHUB_HEAD_REF -e GITHUB_BASE_REF -e GITHUB_EVENT_NAME -e GITHUB_SERVER_URL -e GITHUB_API_URL -e GITHUB_GRAPHQL_URL -e GITHUB_REF_NAME -e GITHUB_REF_PROTECTED -e GITHUB_REF_TYPE -e GITHUB_WORKSPACE -e GITHUB_ACTION -e GITHUB_EVENT_PATH -e GITHUB_ACTION_REPOSITORY -e GITHUB_ACTION_REF -e GITHUB_PATH -e GITHUB_ENV -e GITHUB_STEP_SUMMARY -e RUNNER_OS -e RUNNER_ARCH -e RUNNER_NAME -e RUNNER_TOOL_CACHE -e RUNNER_TEMP -e RUNNER_WORKSPACE -e ACTIONS_RUNTIME_URL -e ACTIONS_RUNTIME_TOKEN -e ACTIONS_CACHE_URL -e GITHUB_ACTIONS=true -e CI=true -v "/var/run/docker.sock":"/var/run/docker.sock" -v "/home/runner/work/_temp/_github_home":"/github/home" -v "/home/runner/work/_temp/_github_workflow":"/github/workflow" -v "/home/runner/work/_temp/_runner_file_commands":"/github/file_commands" -v "/home/runner/work/mock-project/mock-project":"/github/workspace" 4cd98f:5c69b6441ff748baba0e4ccf2b30094c  "" "" ""
standard_init_linux.go:228: exec user process caused: no such file or directory
#+end_quote

/usr/bin/docker run --name cd98f5c69b6441ff748baba0e4ccf2b30094c_756e75 --label 4cd98f --workdir /github/workspace --rm -e INPUT_HMAC -e INPUT_GH-APP-ID-PIVATE-KEY -e INPUT_PLUGIN -e HOME -e GITHUB_JOB -e GITHUB_REF -e GITHUB_SHA -e GITHUB_REPOSITORY -e GITHUB_REPOSITORY_OWNER -e GITHUB_RUN_ID -e GITHUB_RUN_NUMBER -e GITHUB_RETENTION_DAYS -e GITHUB_RUN_ATTEMPT -e GITHUB_ACTOR -e GITHUB_TRIGGERING_ACTOR -e GITHUB_WORKFLOW -e GITHUB_HEAD_REF -e GITHUB_BASE_REF -e GITHUB_EVENT_NAME -e GITHUB_SERVER_URL -e GITHUB_API_URL -e GITHUB_GRAPHQL_URL -e GITHUB_REF_NAME -e GITHUB_REF_PROTECTED -e GITHUB_REF_TYPE -e GITHUB_WORKSPACE -e GITHUB_ACTION -e GITHUB_EVENT_PATH -e GITHUB_ACTION_REPOSITORY -e GITHUB_ACTION_REF -e GITHUB_PATH -e GITHUB_ENV -e GITHUB_STEP_SUMMARY -e RUNNER_OS -e RUNNER_ARCH -e RUNNER_NAME -e RUNNER_TOOL_CACHE -e RUNNER_TEMP -e RUNNER_WORKSPACE -e ACTIONS_RUNTIME_URL -e ACTIONS_RUNTIME_TOKEN -e ACTIONS_CACHE_URL -e GITHUB_ACTIONS=true -e CI=true -v "/var/run/docker.sock":"/var/run/docker.sock" -v "/home/runner/work/_temp/_github_home":"/github/home" -v "/home/runner/work/_temp/_github_workflow":"/github/workflow" -v "/home/runner/work/_temp/_runner_file_commands":"/github/file_commands" -v "/home/runner/work/mock-project/mock-project":"/github/workspace" 4cd98f:5c69b6441ff748baba0e4ccf2b30094c  "" "" ""

#+begin_src tmate :session hpca-cntr-build
docker run hpda:latest hmac private-key
#+end_src

* test
** worksflows
#+name: list workflows
#+begin_src shell
gh workflow list -a
#+end_src

#+RESULTS: list workflows
#+begin_example
Publish	active	32459609
#+end_example

#+name: view workflow
#+begin_src shell
gh workflow view 32459609
#+end_src

#+RESULTS: view workflow
#+begin_example
Publish - publish.yml
ID: 32459609

Total runs 12
Recent runs
completed	success	Store stuff in /mnt	Publish	main	push	3m25s	2864795343
completed	success	Check input	Publish	main	push	2m32s	2864687956
completed	success	Rename INPUT_ variables	Publish	main	push	2m35s	2864332284
completed	success	Use sh (busybox for alpine) instead of bash	Publish	main	push	3m18s	2864194395
completed	success	Try using kodata pre.sh	Publish	main	push	2m39s	2864168103

To see more runs for this workflow, try: gh run list --workflow publish.yml
To see the YAML for this workflow, try: gh workflow view publish.yml --yaml
#+end_example

#+name: view publish.yml
#+begin_src shell :wrap "src yaml"
gh workflow view publish.yml --yaml
#+end_src

#+RESULTS: view publish.yml
#+begin_src yaml
name: Publish

on:
  push:
    branches: ["main"]

jobs:
  publish:
    name: Publish
    runs-on: ubuntu-latest
    steps:
      - uses: actions/setup-go@v2
        with:
          go-version: 1.18.4
      - uses: actions/checkout@v2
      - uses: imjasonh/setup-ko@v0.4
      - run: VERSION=main ko publish --bare ./prow/cmd/hook
#+end_src

#+name: list workflow runs
#+begin_src shell :wrap "src yaml"
gh run list --workflow publish.yml
#+end_src

#+RESULTS: list workflow runs
#+begin_src yaml
completed	success	Store stuff in /mnt	Publish	main	push	2864795343	3m25s	1h
completed	success	Check input	Publish	main	push	2864687956	2m32s	1h
completed	success	Rename INPUT_ variables	Publish	main	push	2864332284	2m35s	3h
completed	success	Use sh (busybox for alpine) instead of bash	Publish	main	push	2864194395	3m18s	3h
completed	success	Try using kodata pre.sh	Publish	main	push	2864168103	2m39s	3h
completed	success	Fix image url	Publish	main	push	2864016473	3m0s	4h
completed	success	Update image ref to use docker://	Publish	main	push	2863954523	2m51s	4h
completed	success	Generate and use :latest image tag for action	Publish	main	push	2863919416	2m35s	4h
completed	success	Update VERSION=main for now for publish	Publish	main	push	2863813133	3m2s	5h
completed	success	Add version to setup-ko run	Publish	main	push	2863024871	3m38s	7h
completed	failure	Simplify .ko.yaml	Publish	main	push	2862993499	44s	7h
completed	failure	Run Publish action on pushes to main	Publish	main	push	2862972408	49s	7h
#+end_src

* Issue / Ticket
- [] create a prow/cmd/pga based on hook
  - [] .ko.yaml
  - actions.yaml
  - prow/cmd/pga
    - main.go
    - USAGE.md (document using cncf-infra/mock-cncf-project) ??
    - DesignDoc.md
    - kodata/{prow+plugin-config.yaml}
- [] provide default (^^) ??
  - can be over-written with inputs
- main needs to
  - not need any files, only ENV vars
  - launch hook http Service ?? If we have to @hh asked that we go direct to func handler
  - ensure service is Ready
  - Send github data to hook url
  - ensure entire plugin is run / complete
  - update output / markdown status
